
&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	ИмяФайла = "";	ПутьФайла = "";	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда	 	Фото = ПутьФайла;                                         
	УстановитьИзображение();
		КонецЕсли; 
КонецПроцедуры

&НаСервереПроцедура УстановитьИзображение()	НовыйФайлИзображения = Справочники.Файлы.СоздатьЭлемент();	НовыйФайлИзображения.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));	Фото = ПоместитьВоВременноеХранилище(НовыйФайлИзображения.Файл.Получить());	НовыйФайлИзображения.Записать();	Объект.Изображение = НовыйФайлИзображения.Ссылка;КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фото = ПолучитьНавигационнуюСсылку(Объект.Изображение, "Файл");	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры
